###一、写代码，有如下列表，按照要求实现每一个功能
li=['alex','bibi','cc0','didi']

#1、计算列表的长度
#2、列表中追加元素'seven',并输出添加后的列表
#3、在列表中的第一个位置插入'Tony'，并输出
#4、在列表中的第2个位置修改值为'kelly'，并输出
#5、请将列表l2=[1,'a',3,4,'heart']的每一个元素添加到列表中，一行代码实现，不许循环添加
#6、请将字符串s='qwert'的每一个元素添加到列表中，一行代码实现，不许循环添加
#7、删除列表中的元素'alex'，并输出列表
#8、删除列表中的第二个元素，输出删除的元素和列表
#9、删除列表中的第2支4个元素，并输出删除元素后的列表
#10、将列表反转，并输出
#11、请计算 'alex'元素在列表中出现的次数，并输出改次数

### 二、写代码，有如下列表，利用切片实现每一个功能
li   = [1,2,3,'a',6,5,'5',]
#1、通过对li列表的切片形成新的列表l1,l1=[1,3,2]
#2、通过对li列表的切片形成新的列表l2,l2=['a',6,5]
#3、通过对li列表的切片形成新的列表l3，l3=[1,3,4,'5']
#4、通过对li列表的切片形成新的列表l4，l4=[2,'a',5]
#5、通过对li列表的切片形成新的列表l5，l5=['c']
#6、通过对li列表的切片形成新的列表l6，l6=[5,'a',2]

### 三、写代码，有如下列表
list=[2,3,'k',['qwe',20['k1',['tt',3,1]],89],'ab']
#1、将列表lis中的'tt'变成大写（两种方式）
#2、将列表lis中的数字3变成'100'（两种方式）
#1、将列表lis中的字符串'1'变成101（两种方式）